<a href="https://colab.research.google.com/github/GuilhermeLimaPes/Intelig-nca-Artificial-fecap/blob/main/Pre_processamento_de_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
dic ={'Nome':['Isa','Peter','Rico'],
      'Idade':['19','28','0'],
      'Salário':['19000','5000','100'],
      'Gênero':['F','M','honda'],
      'Cargo':['Gerente','Supervisor','']
    
}

In [4]:
df = pd.DataFrame(dic)
df

    Nome Idade Salário Gênero       Cargo
0    Isa    19   19000      F     Gerente
1  Peter    28    5000      M  Supervisor
2   Rico     0     100  honda

In [5]:
df.info

<bound method DataFrame.info of     Nome Idade Salário Gênero       Cargo
0    Isa    19   19000      F     Gerente
1  Peter    28    5000      M  Supervisor
2   Rico     0     100  honda            >

In [6]:
df = pd.get_dummies(df, columns=['Gênero'])

In [7]:
df

    Nome Idade Salário       Cargo  Gênero_F  Gênero_M  Gênero_honda
0    Isa    19   19000     Gerente         1         0             0
1  Peter    28    5000  Supervisor         0         1             0
2   Rico     0     100                     0         0             1

In [9]:
df = df.drop(columns=['Cargo'])
df

    Nome Idade Salário  Gênero_F  Gênero_M  Gênero_honda
0    Isa    19   19000         1         0             0
1  Peter    28    5000         0         1             0
2   Rico     0     100         0         0             1